package homework.day10;

public class WaterRunner {
    public static void main(String[] args) {

//        Создать поток данных water класса Water (через new Stream.of)
//        из 4 объектов воды с цветом (Прозрачная, Прозрачная, Мутная, Синяя) и запахом (Нет, Нет, Аммиачный, Мятный)
//        соответственно
//        Отфильтровать воду, цвет которой не "Прозрачная"
//        Отсортировать в нисходящем порядке по запаху
//        На основании существующего потока данных создать новый, в котором каждая новая Water имеет запах с удвоенной
//        буквой ы, если такая встречается
//        Обьединить запах всех обьектов в одну строку
//        Найти количество буков в ней и отпечатаь в консоль

        

    }
}
